Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (Point, Point, Point)
 Constructs a new arc geometry
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	Point startPoint,
	Point endPoint,
	Point pointOnArc
)
Public Sub New (
	startPoint As Point,
	endPoint As Point,
	pointOnArc As Point
)
Parameters
startPoint
Type: Tekla.Structures.Geometry3d.Point
Start point of the arc.
endPoint
Type: Tekla.Structures.Geometry3d.Point
End point of the arc.
pointOnArc
Type: Tekla.Structures.Geometry3d.Point
Point that defines the arc.
Exceptions
Exception | Condition
ArgumentException | Throws when input points are not defined correctly
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Geometry3d Namespace